;(function () {
  angular
    .module('KarmeliApp', [])
    .controller('KarmeliController', KarmeliController)

  function KarmeliController($scope) {
    $scope.text = 'שְׁלוֹם שָׁלוֹם הַתָּכְנָה נִקּוּד נִקּוֹד וּקְרִיאָה וּקְרִיאָהּ בְּעִבְרִית בָּעִבְרִית הַמֻּפְעֶלֶת בְּאֶתֶר בָּאֶתֶר בְּאַתֵּר בַּאֲתַר בַּאֲתָר בָּאֲתָר זֶה מְנַקֶּדֶת טֶקְסְט בְּעִבְרִית בָּעִבְרִית וְגַם מִשְּׁמִיעָה מַשְׁמִיעָה מַשְׁמִיעָהּ אֵת אֶת אַתְּ הַטֶּקְסְט הַמְּנַקֵּד'
    $scope.upper = upper
    $scope.toKarmeliUpper = toKarmeliUpper
    $scope.toKarmeliLower = toKarmeliLower
  }

  function toKarmeliUpper(str) {
    return Array.prototype.map.call(str, function (c) {
      if (upper[c])
        return upper[c]
      return c
    }).join('')
  }

  function toKarmeliLower(str) {
    return Array.prototype.map.call(str, function (c) {
      if (upper[c])
        return lower[c]
      return c
    }).join('')
  }

  // TODO:
  // קמץ קטן
  // צירה חסר ומלא
  // אותיות דגושות ב ו כ פ
  // אותיות עם גרש ז צ
  // שווא נח ונא
  // חולם מלא \u05B9
  // שורוק
  const upper = {
    '\u{05D0}': '\u{00C3}', // א
    '\u{05B8}': 'A',        // קמץ
    '\u{05B7}': 'A',        // פתח
    '\u{05D1}': 'V',        // ב
    '\u{05D2}': 'G',        // ג
    '\u{05D3}': 'D',        // ד
    '\u{05D4}': 'H',        // ה
    '\u{05B6}': 'E',        // סגול
    '\u{05B5}': 'E',        // צירי
    '\u{05D5}': 'W',        // ו
    '\u{05BB}': 'U',        // קובוץ
    '\u{05D6}': 'Z',        // ז
    '\u{05D7}': '\u{00C6}', // ח
    '\u{05D8}': '\u{00DE}', // ט
    '\u{05D9}': 'Y',        // י
    '\u{05B4}': 'I',        // חיריק
    '\u{05DA}': 'X',        // ך
    '\u{05DB}': 'X',        // כ
    '\u{05DC}': 'L',        // ל
    '\u{05DD}': 'M',        // ם
    '\u{05DE}': 'M',        // מ
    '\u{05DF}': 'N',        // ן
    '\u{05E0}': 'N',        // נ
    '\u{05E1}': 'S',        // ס
    '\u{05E2}': '\u{00D5}', // ע
    '\u{05BA}': 'O',        // חולם חסר
    '\u{05E3}': 'F',        // ף
    '\u{05E4}': 'F',        // פ
    '\u{05E5}': 'C',        // ץ
    '\u{05E6}': 'C',        // צ
    '\u{05E7}': 'Q',        // ק
    '\u{05E8}': 'R',        // ר
    '\u{05E9}': '\u{0160}', // ש
    '\u{05EA}': 'T',        // ת
    '\u{05B2}': '\u{00C1}', // חטף פתח
    '\u{05B1}': '\u{00C9}', // חטף סגול
    '\u{05B3}': '\u{00D3}'  // חטף קמץ
  }

  const lower = {
    '\u{05D0}': '\u{00E3}', // א
    '\u{05B8}': 'a',        // קמץ
    '\u{05B7}': 'a',        // פתח
    '\u{05D1}': 'v',        // ב
    '\u{05D2}': 'g',        // ג
    '\u{05D3}': 'd',        // ד
    '\u{05D4}': 'h',        // ה
    '\u{05B6}': 'e',        // סגול
    '\u{05B5}': 'e',        // צירי
    '\u{05D5}': 'w',        // ו
    '\u{05BB}': 'u',        // קובוץ
    '\u{05D6}': 'z',        // ז
    '\u{05D7}': '\u{00E6}', // ח
    '\u{05D8}': '\u{00FE}', // ט
    '\u{05D9}': 'y',        // י
    '\u{05B4}': 'i',        // חיריק
    '\u{05DA}': 'x',        // ך
    '\u{05DB}': 'x',        // כ
    '\u{05DC}': 'l',        // ל
    '\u{05DD}': 'm',        // ם
    '\u{05DE}': 'm',        // מ
    '\u{05DF}': 'n',        // ן
    '\u{05E0}': 'n',        // נ
    '\u{05E1}': 's',        // ס
    '\u{05E2}': '\u{00F5}', // ע
    '\u{05BA}': 'o',        // חולם חסר
    '\u{05E3}': 'f',        // ף
    '\u{05E4}': 'f',        // פ
    '\u{05E5}': 'c',        // ץ
    '\u{05E6}': 'c',        // צ
    '\u{05E7}': 'q',        // ק
    '\u{05E8}': 'r',        // ר
    '\u{05E9}': '\u{0161}', // ש
    '\u{05EA}': 't',        // ת
    '\u{05B2}': '\u{00E1}', // חטף פתח
    '\u{05B1}': '\u{00E9}', // חטף סגול
    '\u{05B3}': '\u{00F3}'  // חטף קמץ
  }

}())
